"""
Lesson 10
07.12.2024

Базовые типы данных
Условные конструкци + вложенные условные конструкции
Строки
Итерация по строкам
Срезы строк
Циклы for и while и вложенные циклы
Словари, списки словарей, методы словарей
Функции. Фунции все типы аргументов. *args, **kwargs?
Гит, гитхаб. Гитлаб.
----

1. Создать проект
2. Инициализировать гит
git init
3. Создать окружение
4. Добавить в гитигнор файлы окружения
5. Сделать файл lesson_10.py
5.1 Создать .gitignore
5.2 Добавить в него виртуальное окружение
6. Сделать первые коммиты
- git add <file_name>
- git commit -m "message"
7. Добавить файлы в гит
8. Закоммитить изменения
9. Запушить изменения в гитхаб
"""