"""
Мои заметки
"""


"""
DRY - Don't repeat yourself
Принцип DRY (Don't Repeat Yourself) - это принцип разработки программного обеспечения, который гласит, что каждая часть программы должна быть написана только один раз и должна быть доступна для использования в других частях программы.

SRP - Single Responsibility Principle
Принцип единственной ответственности (Single Responsibility Principle, SRP) - это принцип разработки программного обеспечения, который гласит, что каждый класс или модуль должен иметь только одну ответственность или задачу.
"""